tools/ficha/fixtures/producer-perf-test-tuning-lz4-acks1.txt
# Capturado del lab 07 levantado con bin/start-lab.sh (Kafka 8.2.0-ccs, 3 brokers, topico novatech.tuning.bench). Salida completa del wrapper:  kafka-cli/perf-test.sh novatech.tuning.bench 20000 --batch-size 65536 --linger-ms 10 --compression lz4 --acks 1
[Perf Test] novatech.tuning.bench
  Mensajes:        20000
  Tamaño:          200 bytes
  Acks:            1
  Batch size:      65536 bytes
  Linger ms:       10
  Compresión:      lz4
  Throughput cap:  -1 msg/seg
────────────────────────────────────────────────────────
Option --producer-props has been deprecated and will be removed in a future version. Use --command-property instead.
20000 records sent, 65573.770492 records/sec (12.51 MB/sec), 24.02 ms avg latency, 234.00 ms max latency, 25 ms 50th, 38 ms 95th, 42 ms 99th, 43 ms 99.9th.